IDENTIFICATION DIVISION.
PROGRAM-ID. WITHDRAW.
AUTHOR. KAUSHIK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BALANCE        PIC 9(5).
01 WITHDRAW-AMT   PIC 9(5).
01 MIN-BAL        PIC 9(4) VALUE 1000.

PROCEDURE DIVISION.
    DISPLAY "Enter Current Balance: "
    ACCEPT BALANCE

    DISPLAY "Enter Withdrawal Amount: "
    ACCEPT WITHDRAW-AMT

    IF (BALANCE - WITHDRAW-AMT) >= MIN-BAL
        SUBTRACT WITHDRAW-AMT FROM BALANCE
        DISPLAY "Withdrawal Successful. New Balance: " BALANCE
    ELSE
        DISPLAY "Insufficient Balance"
    END-IF

    STOP RUN. 