 IDENTIFICATION DIVISION.
PROGRAM-ID. REVERSE-NUMBER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM   PIC 9(5).
01 REM      PIC 9.
01 REV  PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY "ENTER A 5 DIGIT NUMBER:"
    ACCEPT NUM
    
    PERFORM UNTIL NUM = 0
        DIVIDE 10 INTO NUM
            GIVING NUM
            REMAINDER REM
        COMPUTE REV = (REV * 10) + REM
    END-PERFORM
    
    DISPLAY "REVERSED NUMBER : " REV
    
    STOP RUN.

