 IDENTIFICATION DIVISION.
       PROGRAM-ID. SIMPLE-INTEREST.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PRINCIPAL   PIC 9(6).
       01  RATE        PIC 9(2).
       01  TIME        PIC 9(2).
       01  INTEREST    PIC 9(7)V9(2).

       PROCEDURE DIVISION.
           DISPLAY "ENTER PRINCIPAL AMOUNT: "
           ACCEPT PRINCIPAL

           DISPLAY "ENTER RATE OF INTEREST: "
           ACCEPT RATE

           DISPLAY "ENTER TIME (IN YEARS): "
           ACCEPT TIME

           COMPUTE INTEREST = (PRINCIPAL * RATE * TIME) / 100

           DISPLAY "SIMPLE INTEREST IS: " INTEREST

           STOP RUN.

