IDENTIFICATION DIVISION.
PROGRAM-ID. SUM-20-NUMBERS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMBERS.
   05 WS-NUM PIC 9(4) OCCURS 20 TIMES.
01 WS-I     PIC 9(2).
01 WS-SUM   PIC 9(6) VALUE 0.
PROCEDURE DIVISION.
    DISPLAY "ENTER 20 NUMBERS".
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 20
        DISPLAY "ENTER NUMBER " WS-I ":"
        ACCEPT WS-NUM(WS-I)
        ADD WS-NUM(WS-I) TO WS-SUM
    END-PERFORM
    DISPLAY "TOTAL SUM : " WS-SUM
    STOP RUN.
